espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG21/Include/efr32bg21_iadc.h
/** @} End of group EFR32BG21_IADC */

/**************************************************************************//**
 * @addtogroup EFR32BG21_IADC
 * @{
 * @defgroup EFR32BG21_IADC_BitFields IADC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for IADC IPVERSION */
#define _IADC_IPVERSION_RESETVALUE                      0x00000000UL                             /**< Default value for IADC_IPVERSION            */
#define _IADC_IPVERSION_MASK                            0xFFFFFFFFUL                             /**< Mask for IADC_IPVERSION                     */
#define _IADC_IPVERSION_IPVERSION_SHIFT                 0                                        /**< Shift value for IADC_IPVERSION              */
#define _IADC_IPVERSION_IPVERSION_MASK                  0xFFFFFFFFUL                             /**< Bit mask for IADC_IPVERSION                 */
#define _IADC_IPVERSION_IPVERSION_DEFAULT               0x00000000UL                             /**< Mode DEFAULT for IADC_IPVERSION             */
#define IADC_IPVERSION_IPVERSION_DEFAULT                (_IADC_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_IPVERSION     */

/* Bit fields for IADC EN */
#define _IADC_EN_RESETVALUE                             0x00000000UL                    /**< Default value for IADC_EN                   */
#define _IADC_EN_MASK                                   0x00000001UL                    /**< Mask for IADC_EN                            */
#define IADC_EN_EN                                      (0x1UL << 0)                    /**< Enable IADC Module                          */
#define _IADC_EN_EN_SHIFT                               0                               /**< Shift value for IADC_EN                     */
#define _IADC_EN_EN_MASK                                0x1UL                           /**< Bit mask for IADC_EN                        */
#define _IADC_EN_EN_DEFAULT                             0x00000000UL                    /**< Mode DEFAULT for IADC_EN                    */
#define _IADC_EN_EN_DISABLE                             0x00000000UL                    /**< Mode DISABLE for IADC_EN                    */
#define _IADC_EN_EN_ENABLE                              0x00000001UL                    /**< Mode ENABLE for IADC_EN                     */
#define IADC_EN_EN_DEFAULT                              (_IADC_EN_EN_DEFAULT << 0)      /**< Shifted mode DEFAULT for IADC_EN            */
#define IADC_EN_EN_DISABLE                              (_IADC_EN_EN_DISABLE << 0)      /**< Shifted mode DISABLE for IADC_EN            */
#define IADC_EN_EN_ENABLE                               (_IADC_EN_EN_ENABLE << 0)       /**< Shifted mode ENABLE for IADC_EN             */

/* Bit fields for IADC CTRL */
#define _IADC_CTRL_RESETVALUE                           0x00000000UL                               /**< Default value for IADC_CTRL                 */
#define _IADC_CTRL_MASK                                 0x707F003EUL                               /**< Mask for IADC_CTRL                          */
#define IADC_CTRL_ADCCLKSUSPEND0                        (0x1UL << 1)                               /**< ADC_CLK Suspend - PRS0                      */
#define _IADC_CTRL_ADCCLKSUSPEND0_SHIFT                 1                                          /**< Shift value for IADC_ADCCLKSUSPEND0         */
#define _IADC_CTRL_ADCCLKSUSPEND0_MASK                  0x2UL                                      /**< Bit mask for IADC_ADCCLKSUSPEND0            */
#define _IADC_CTRL_ADCCLKSUSPEND0_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for IADC_CTRL                  */
#define _IADC_CTRL_ADCCLKSUSPEND0_PRSWUDIS              0x00000000UL                               /**< Mode PRSWUDIS for IADC_CTRL                 */
#define _IADC_CTRL_ADCCLKSUSPEND0_PRSWUEN               0x00000001UL                               /**< Mode PRSWUEN for IADC_CTRL                  */
#define IADC_CTRL_ADCCLKSUSPEND0_DEFAULT                (_IADC_CTRL_ADCCLKSUSPEND0_DEFAULT << 1)   /**< Shifted mode DEFAULT for IADC_CTRL          */
#define IADC_CTRL_ADCCLKSUSPEND0_PRSWUDIS               (_IADC_CTRL_ADCCLKSUSPEND0_PRSWUDIS << 1)  /**< Shifted mode PRSWUDIS for IADC_CTRL         */
#define IADC_CTRL_ADCCLKSUSPEND0_PRSWUEN                (_IADC_CTRL_ADCCLKSUSPEND0_PRSWUEN << 1)   /**< Shifted mode PRSWUEN for IADC_CTRL          */
#define IADC_CTRL_ADCCLKSUSPEND1                        (0x1UL << 2)                               /**< ADC_CLK Suspend - PRS1                      */
#define _IADC_CTRL_ADCCLKSUSPEND1_SHIFT                 2                                          /**< Shift value for IADC_ADCCLKSUSPEND1         */
#define _IADC_CTRL_ADCCLKSUSPEND1_MASK                  0x4UL                                      /**< Bit mask for IADC_ADCCLKSUSPEND1            */
#define _IADC_CTRL_ADCCLKSUSPEND1_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for IADC_CTRL                  */
#define _IADC_CTRL_ADCCLKSUSPEND1_PRSWUDIS              0x00000000UL                               /**< Mode PRSWUDIS for IADC_CTRL                 */
#define _IADC_CTRL_ADCCLKSUSPEND1_PRSWUEN               0x00000001UL                               /**< Mode PRSWUEN for IADC_CTRL                  */
#define IADC_CTRL_ADCCLKSUSPEND1_DEFAULT                (_IADC_CTRL_ADCCLKSUSPEND1_DEFAULT << 2)   /**< Shifted mode DEFAULT for IADC_CTRL          */
#define IADC_CTRL_ADCCLKSUSPEND1_PRSWUDIS               (_IADC_CTRL_ADCCLKSUSPEND1_PRSWUDIS << 2)  /**< Shifted mode PRSWUDIS for IADC_CTRL         */
#define IADC_CTRL_ADCCLKSUSPEND1_PRSWUEN                (_IADC_CTRL_ADCCLKSUSPEND1_PRSWUEN << 2)   /**< Shifted mode PRSWUEN for IADC_CTRL          */
#define IADC_CTRL_DBGHALT                               (0x1UL << 3)                               /**< Debug Halt                                  */
#define _IADC_CTRL_DBGHALT_SHIFT                        3                                          /**< Shift value for IADC_DBGHALT                */
#define _IADC_CTRL_DBGHALT_MASK                         0x8UL                                      /**< Bit mask for IADC_DBGHALT                   */
#define _IADC_CTRL_DBGHALT_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for IADC_CTRL                  */
#define _IADC_CTRL_DBGHALT_NORMAL                       0x00000000UL                               /**< Mode NORMAL for IADC_CTRL                   */
#define _IADC_CTRL_DBGHALT_HALT                         0x00000001UL                               /**< Mode HALT for IADC_CTRL                     */
#define IADC_CTRL_DBGHALT_DEFAULT                       (_IADC_CTRL_DBGHALT_DEFAULT << 3)          /**< Shifted mode DEFAULT for IADC_CTRL          */
#define IADC_CTRL_DBGHALT_NORMAL                        (_IADC_CTRL_DBGHALT_NORMAL << 3)           /**< Shifted mode NORMAL for IADC_CTRL           */
#define IADC_CTRL_DBGHALT_HALT                          (_IADC_CTRL_DBGHALT_HALT << 3)             /**< Shifted mode HALT for IADC_CTRL             */
#define _IADC_CTRL_WARMUPMODE_SHIFT                     4                                          /**< Shift value for IADC_WARMUPMODE             */
#define _IADC_CTRL_WARMUPMODE_MASK                      0x30UL                                     /**< Bit mask for IADC_WARMUPMODE                */
#define _IADC_CTRL_WARMUPMODE_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for IADC_CTRL                  */
#define _IADC_CTRL_WARMUPMODE_NORMAL                    0x00000000UL                               /**< Mode NORMAL for IADC_CTRL                   */
#define _IADC_CTRL_WARMUPMODE_KEEPINSTANDBY             0x00000001UL                               /**< Mode KEEPINSTANDBY for IADC_CTRL            */
#define _IADC_CTRL_WARMUPMODE_KEEPWARM                  0x00000002UL                               /**< Mode KEEPWARM for IADC_CTRL                 */
#define IADC_CTRL_WARMUPMODE_DEFAULT                    (_IADC_CTRL_WARMUPMODE_DEFAULT << 4)       /**< Shifted mode DEFAULT for IADC_CTRL          */
#define IADC_CTRL_WARMUPMODE_NORMAL                     (_IADC_CTRL_WARMUPMODE_NORMAL << 4)        /**< Shifted mode NORMAL for IADC_CTRL           */
#define IADC_CTRL_WARMUPMODE_KEEPINSTANDBY              (_IADC_CTRL_WARMUPMODE_KEEPINSTANDBY << 4) /**< Shifted mode KEEPINSTANDBY for IADC_CTRL    */
#define IADC_CTRL_WARMUPMODE_KEEPWARM                   (_IADC_CTRL_WARMUPMODE_KEEPWARM << 4)      /**< Shifted mode KEEPWARM for IADC_CTRL         */
#define _IADC_CTRL_TIMEBASE_SHIFT                       16                                         /**< Shift value for IADC_TIMEBASE               */
#define _IADC_CTRL_TIMEBASE_MASK                        0x7F0000UL                                 /**< Bit mask for IADC_TIMEBASE                  */
#define _IADC_CTRL_TIMEBASE_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for IADC_CTRL                  */
#define IADC_CTRL_TIMEBASE_DEFAULT                      (_IADC_CTRL_TIMEBASE_DEFAULT << 16)        /**< Shifted mode DEFAULT for IADC_CTRL          */
#define _IADC_CTRL_HSCLKRATE_SHIFT                      28                                         /**< Shift value for IADC_HSCLKRATE              */
#define _IADC_CTRL_HSCLKRATE_MASK                       0x70000000UL                               /**< Bit mask for IADC_HSCLKRATE                 */
#define _IADC_CTRL_HSCLKRATE_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for IADC_CTRL                  */
#define _IADC_CTRL_HSCLKRATE_DIV1                       0x00000000UL                               /**< Mode DIV1 for IADC_CTRL                     */
#define _IADC_CTRL_HSCLKRATE_DIV2                       0x00000001UL                               /**< Mode DIV2 for IADC_CTRL                     */
#define _IADC_CTRL_HSCLKRATE_DIV3                       0x00000002UL                               /**< Mode DIV3 for IADC_CTRL                     */
#define _IADC_CTRL_HSCLKRATE_DIV4                       0x00000003UL                               /**< Mode DIV4 for IADC_CTRL                     */
#define IADC_CTRL_HSCLKRATE_DEFAULT                     (_IADC_CTRL_HSCLKRATE_DEFAULT << 28)       /**< Shifted mode DEFAULT for IADC_CTRL          */
#define IADC_CTRL_HSCLKRATE_DIV1                        (_IADC_CTRL_HSCLKRATE_DIV1 << 28)          /**< Shifted mode DIV1 for IADC_CTRL             */
#define IADC_CTRL_HSCLKRATE_DIV2                        (_IADC_CTRL_HSCLKRATE_DIV2 << 28)          /**< Shifted mode DIV2 for IADC_CTRL             */
#define IADC_CTRL_HSCLKRATE_DIV3                        (_IADC_CTRL_HSCLKRATE_DIV3 << 28)          /**< Shifted mode DIV3 for IADC_CTRL             */
#define IADC_CTRL_HSCLKRATE_DIV4                        (_IADC_CTRL_HSCLKRATE_DIV4 << 28)          /**< Shifted mode DIV4 for IADC_CTRL             */

/* Bit fields for IADC CMD */
#define _IADC_CMD_RESETVALUE                            0x00000000UL                         /**< Default value for IADC_CMD                  */
#define _IADC_CMD_MASK                                  0x0003001BUL                         /**< Mask for IADC_CMD                           */
#define IADC_CMD_SINGLESTART                            (0x1UL << 0)                         /**< Single Queue Start                          */
#define _IADC_CMD_SINGLESTART_SHIFT                     0                                    /**< Shift value for IADC_SINGLESTART            */
#define _IADC_CMD_SINGLESTART_MASK                      0x1UL                                /**< Bit mask for IADC_SINGLESTART               */
#define _IADC_CMD_SINGLESTART_DEFAULT                   0x00000000UL                         /**< Mode DEFAULT for IADC_CMD                   */
#define IADC_CMD_SINGLESTART_DEFAULT                    (_IADC_CMD_SINGLESTART_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_CMD           */
#define IADC_CMD_SINGLESTOP                             (0x1UL << 1)                         /**< Single Queue Stop                           */
#define _IADC_CMD_SINGLESTOP_SHIFT                      1                                    /**< Shift value for IADC_SINGLESTOP             */
#define _IADC_CMD_SINGLESTOP_MASK                       0x2UL                                /**< Bit mask for IADC_SINGLESTOP                */
#define _IADC_CMD_SINGLESTOP_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for IADC_CMD                   */
#define IADC_CMD_SINGLESTOP_DEFAULT                     (_IADC_CMD_SINGLESTOP_DEFAULT << 1)  /**< Shifted mode DEFAULT for IADC_CMD           */
#define IADC_CMD_SCANSTART                              (0x1UL << 3)                         /**< Scan Queue Start                            */
#define _IADC_CMD_SCANSTART_SHIFT                       3                                    /**< Shift value for IADC_SCANSTART              */
#define _IADC_CMD_SCANSTART_MASK                        0x8UL                                /**< Bit mask for IADC_SCANSTART                 */
#define _IADC_CMD_SCANSTART_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for IADC_CMD                   */
#define IADC_CMD_SCANSTART_DEFAULT                      (_IADC_CMD_SCANSTART_DEFAULT << 3)   /**< Shifted mode DEFAULT for IADC_CMD           */
#define IADC_CMD_SCANSTOP                               (0x1UL << 4)                         /**< Scan Queue Stop                             */
#define _IADC_CMD_SCANSTOP_SHIFT                        4                                    /**< Shift value for IADC_SCANSTOP               */
#define _IADC_CMD_SCANSTOP_MASK                         0x10UL                               /**< Bit mask for IADC_SCANSTOP                  */
#define _IADC_CMD_SCANSTOP_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for IADC_CMD                   */
#define IADC_CMD_SCANSTOP_DEFAULT                       (_IADC_CMD_SCANSTOP_DEFAULT << 4)    /**< Shifted mode DEFAULT for IADC_CMD           */
#define IADC_CMD_TIMEREN                                (0x1UL << 16)                        /**< Timer Enable                                */
#define _IADC_CMD_TIMEREN_SHIFT                         16                                   /**< Shift value for IADC_TIMEREN                */
#define _IADC_CMD_TIMEREN_MASK                          0x10000UL                            /**< Bit mask for IADC_TIMEREN                   */
#define _IADC_CMD_TIMEREN_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for IADC_CMD                   */
#define IADC_CMD_TIMEREN_DEFAULT                        (_IADC_CMD_TIMEREN_DEFAULT << 16)    /**< Shifted mode DEFAULT for IADC_CMD           */
#define IADC_CMD_TIMERDIS                               (0x1UL << 17)                        /**< Timer Disable                               */
#define _IADC_CMD_TIMERDIS_SHIFT                        17                                   /**< Shift value for IADC_TIMERDIS               */
#define _IADC_CMD_TIMERDIS_MASK                         0x20000UL                            /**< Bit mask for IADC_TIMERDIS                  */
#define _IADC_CMD_TIMERDIS_DEFAULT                      0x00000000UL                         /**< Mode DEFAULT for IADC_CMD                   */
#define IADC_CMD_TIMERDIS_DEFAULT                       (_IADC_CMD_TIMERDIS_DEFAULT << 17)   /**< Shifted mode DEFAULT for IADC_CMD           */

/* Bit fields for IADC TIMER */
#define _IADC_TIMER_RESETVALUE                          0x00000000UL                     /**< Default value for IADC_TIMER                */
#define _IADC_TIMER_MASK                                0x0000FFFFUL                     /**< Mask for IADC_TIMER                         */
#define _IADC_TIMER_TIMER_SHIFT                         0                                /**< Shift value for IADC_TIMER                  */
#define _IADC_TIMER_TIMER_MASK                          0xFFFFUL                         /**< Bit mask for IADC_TIMER                     */
#define _IADC_TIMER_TIMER_DEFAULT                       0x00000000UL                     /**< Mode DEFAULT for IADC_TIMER                 */
#define IADC_TIMER_TIMER_DEFAULT                        (_IADC_TIMER_TIMER_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_TIMER         */

