espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG21/Include/efr32bg21_iadc.h
/* Bit fields for IADC IEN */
#define _IADC_IEN_RESETVALUE                            0x00000000UL                             /**< Default value for IADC_IEN                  */
#define _IADC_IEN_MASK                                  0x800F338FUL                             /**< Mask for IADC_IEN                           */
#define IADC_IEN_SINGLEFIFODVL                          (0x1UL << 0)                             /**< Single FIFO Data Valid Level Enable         */
#define _IADC_IEN_SINGLEFIFODVL_SHIFT                   0                                        /**< Shift value for IADC_SINGLEFIFODVL          */
#define _IADC_IEN_SINGLEFIFODVL_MASK                    0x1UL                                    /**< Bit mask for IADC_SINGLEFIFODVL             */
#define _IADC_IEN_SINGLEFIFODVL_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SINGLEFIFODVL_DEFAULT                  (_IADC_IEN_SINGLEFIFODVL_DEFAULT << 0)   /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_SCANFIFODVL                            (0x1UL << 1)                             /**< Scan FIFO Data Valid Level Enable           */
#define _IADC_IEN_SCANFIFODVL_SHIFT                     1                                        /**< Shift value for IADC_SCANFIFODVL            */
#define _IADC_IEN_SCANFIFODVL_MASK                      0x2UL                                    /**< Bit mask for IADC_SCANFIFODVL               */
#define _IADC_IEN_SCANFIFODVL_DEFAULT                   0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SCANFIFODVL_DEFAULT                    (_IADC_IEN_SCANFIFODVL_DEFAULT << 1)     /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_SINGLECMP                              (0x1UL << 2)                             /**< Single Result Window Compare Enable         */
#define _IADC_IEN_SINGLECMP_SHIFT                       2                                        /**< Shift value for IADC_SINGLECMP              */
#define _IADC_IEN_SINGLECMP_MASK                        0x4UL                                    /**< Bit mask for IADC_SINGLECMP                 */
#define _IADC_IEN_SINGLECMP_DEFAULT                     0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SINGLECMP_DEFAULT                      (_IADC_IEN_SINGLECMP_DEFAULT << 2)       /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_SCANCMP                                (0x1UL << 3)                             /**< Scan Result Window Compare Enable           */
#define _IADC_IEN_SCANCMP_SHIFT                         3                                        /**< Shift value for IADC_SCANCMP                */
#define _IADC_IEN_SCANCMP_MASK                          0x8UL                                    /**< Bit mask for IADC_SCANCMP                   */
#define _IADC_IEN_SCANCMP_DEFAULT                       0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SCANCMP_DEFAULT                        (_IADC_IEN_SCANCMP_DEFAULT << 3)         /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_SCANENTRYDONE                          (0x1UL << 7)                             /**< Scan Entry Done Enable                      */
#define _IADC_IEN_SCANENTRYDONE_SHIFT                   7                                        /**< Shift value for IADC_SCANENTRYDONE          */
#define _IADC_IEN_SCANENTRYDONE_MASK                    0x80UL                                   /**< Bit mask for IADC_SCANENTRYDONE             */
#define _IADC_IEN_SCANENTRYDONE_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SCANENTRYDONE_DEFAULT                  (_IADC_IEN_SCANENTRYDONE_DEFAULT << 7)   /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_SCANTABLEDONE                          (0x1UL << 8)                             /**< Scan Table Done Enable                      */
#define _IADC_IEN_SCANTABLEDONE_SHIFT                   8                                        /**< Shift value for IADC_SCANTABLEDONE          */
#define _IADC_IEN_SCANTABLEDONE_MASK                    0x100UL                                  /**< Bit mask for IADC_SCANTABLEDONE             */
#define _IADC_IEN_SCANTABLEDONE_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SCANTABLEDONE_DEFAULT                  (_IADC_IEN_SCANTABLEDONE_DEFAULT << 8)   /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_SINGLEDONE                             (0x1UL << 9)                             /**< Single Conversion Done Enable               */
#define _IADC_IEN_SINGLEDONE_SHIFT                      9                                        /**< Shift value for IADC_SINGLEDONE             */
#define _IADC_IEN_SINGLEDONE_MASK                       0x200UL                                  /**< Bit mask for IADC_SINGLEDONE                */
#define _IADC_IEN_SINGLEDONE_DEFAULT                    0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SINGLEDONE_DEFAULT                     (_IADC_IEN_SINGLEDONE_DEFAULT << 9)      /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_POLARITYERR                            (0x1UL << 12)                            /**< Polarity Error Enable                       */
#define _IADC_IEN_POLARITYERR_SHIFT                     12                                       /**< Shift value for IADC_POLARITYERR            */
#define _IADC_IEN_POLARITYERR_MASK                      0x1000UL                                 /**< Bit mask for IADC_POLARITYERR               */
#define _IADC_IEN_POLARITYERR_DEFAULT                   0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_POLARITYERR_DEFAULT                    (_IADC_IEN_POLARITYERR_DEFAULT << 12)    /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_PORTALLOCERR                           (0x1UL << 13)                            /**< Port Allocation Error Enable                */
#define _IADC_IEN_PORTALLOCERR_SHIFT                    13                                       /**< Shift value for IADC_PORTALLOCERR           */
#define _IADC_IEN_PORTALLOCERR_MASK                     0x2000UL                                 /**< Bit mask for IADC_PORTALLOCERR              */
#define _IADC_IEN_PORTALLOCERR_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_PORTALLOCERR_DEFAULT                   (_IADC_IEN_PORTALLOCERR_DEFAULT << 13)   /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_SINGLEFIFOOF                           (0x1UL << 16)                            /**< Single FIFO Overflow Enable                 */
#define _IADC_IEN_SINGLEFIFOOF_SHIFT                    16                                       /**< Shift value for IADC_SINGLEFIFOOF           */
#define _IADC_IEN_SINGLEFIFOOF_MASK                     0x10000UL                                /**< Bit mask for IADC_SINGLEFIFOOF              */
#define _IADC_IEN_SINGLEFIFOOF_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SINGLEFIFOOF_DEFAULT                   (_IADC_IEN_SINGLEFIFOOF_DEFAULT << 16)   /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_SCANFIFOOF                             (0x1UL << 17)                            /**< Scan FIFO Overflow Enable                   */
#define _IADC_IEN_SCANFIFOOF_SHIFT                      17                                       /**< Shift value for IADC_SCANFIFOOF             */
#define _IADC_IEN_SCANFIFOOF_MASK                       0x20000UL                                /**< Bit mask for IADC_SCANFIFOOF                */
#define _IADC_IEN_SCANFIFOOF_DEFAULT                    0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SCANFIFOOF_DEFAULT                     (_IADC_IEN_SCANFIFOOF_DEFAULT << 17)     /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_SINGLEFIFOUF                           (0x1UL << 18)                            /**< Single FIFO Underflow Enable                */
#define _IADC_IEN_SINGLEFIFOUF_SHIFT                    18                                       /**< Shift value for IADC_SINGLEFIFOUF           */
#define _IADC_IEN_SINGLEFIFOUF_MASK                     0x40000UL                                /**< Bit mask for IADC_SINGLEFIFOUF              */
#define _IADC_IEN_SINGLEFIFOUF_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SINGLEFIFOUF_DEFAULT                   (_IADC_IEN_SINGLEFIFOUF_DEFAULT << 18)   /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_SCANFIFOUF                             (0x1UL << 19)                            /**< Scan FIFO Underflow Enable                  */
#define _IADC_IEN_SCANFIFOUF_SHIFT                      19                                       /**< Shift value for IADC_SCANFIFOUF             */
#define _IADC_IEN_SCANFIFOUF_MASK                       0x80000UL                                /**< Bit mask for IADC_SCANFIFOUF                */
#define _IADC_IEN_SCANFIFOUF_DEFAULT                    0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_SCANFIFOUF_DEFAULT                     (_IADC_IEN_SCANFIFOUF_DEFAULT << 19)     /**< Shifted mode DEFAULT for IADC_IEN           */
#define IADC_IEN_EM23ABORTERROR                         (0x1UL << 31)                            /**< EM2/3 Abort Error Enable                    */
#define _IADC_IEN_EM23ABORTERROR_SHIFT                  31                                       /**< Shift value for IADC_EM23ABORTERROR         */
#define _IADC_IEN_EM23ABORTERROR_MASK                   0x80000000UL                             /**< Bit mask for IADC_EM23ABORTERROR            */
#define _IADC_IEN_EM23ABORTERROR_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for IADC_IEN                   */
#define IADC_IEN_EM23ABORTERROR_DEFAULT                 (_IADC_IEN_EM23ABORTERROR_DEFAULT << 31) /**< Shifted mode DEFAULT for IADC_IEN           */

